'''Задача 1'''
# num=int(input("Введите трехзначное число:"))
# a=num//100
# b=(num%100)//10
# c=num%10
# sum=a+b+c
# print(sum)
'''Задача 2'''
# num=int(input("Введите число:"))
# a=num//3
# b=a//2
# c=b+(num//2)
# print(f"Катя {c}")
# print(f"Петя {b}")    
# print(f"Сережа {b}")
'''Задача 3'''
# num=int(input("Введите шестизначный код с билета :"))
# a=num//100000
# b=(num//10000)%10
# c=(num//1000)%10
# d=(num//100)%10
# e=(num//10)%10
# f=num%10
# if((a+b+c)==(d+e+f)):
#    print("У вас счастливый билет!!!")
# else:
#    print("У вас не счастливый билет, gовезет в сдедующий раз")
